#+TITLE:     Strukturen
#+AUTHOR:    Thomas Hausberger, Matthias Panny, Sebastian Stabinger
#+DATE:      SS2022

*** Beispiel :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC C :results output :exports both
  #include <stdio.h>

  typedef struct Complex {
    double real;
    double imag;
  } Complex;

  int main() {
    Complex c;
    // Schreibender Zugriff
    c.real = 12.3;
    c.imag = 2.3;
    // Lesender Zugriff
    printf("%f + %fi", c.real, c.imag);
  }
#+END_SRC

#+RESULTS:
: 12.300000 + 2.300000i

*** Beispiel :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC C :results output :exports both
  #include <stdio.h>

  typedef struct Complex {
    double real;
    double imag;
  } Complex;

  int main() {
    Complex c = {1.2, 0.234};
    printf("%f + %fi", c.real, c.imag);
  }
#+END_SRC

#+RESULTS:
: 1.200000 + 0.234000i
